7767517
133 200
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Slice                    unbind_0                 1 2 in1 5 6 -23300=2,-233,-233 1=0
Reshape                  reshape_34               1 1 6 7 0=36 1=1
Reshape                  reshape_35               1 1 5 8 0=36 1=1
Flatten                  flatten_55               1 1 2 9
InnerProduct             fcrelu_0                 1 1 9 10 0=36 1=1 2=2592 9=1
ExpandDims               unsqueeze_66             1 1 10 11 -23303=1,0
LSTM                     lstm_21                  3 3 11 8 7 12 13 14 0=36 1=5184 2=0 3=36
Gemm                     gemm_0                   1 1 12 15 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=6 9=36
Squeeze                  squeeze_59               1 1 15 16 -23303=1,-2
Split                    splitncnn_1              1 3 16 17 18 19
Concat                   stack_0                  2 1 13 14 out2 0=0
Slice                    unbind_1                 1 6 1 21 22 23 24 25 26 -23300=6,-233,-233,-233,-233,-233,-233 1=0
Reshape                  reshape_37               1 1 26 27 0=12
Reshape                  reshape_38               1 1 25 28 0=12
Reshape                  reshape_39               1 1 24 29 0=12
Split                    splitncnn_2              1 2 29 30 31
Reshape                  reshape_40               1 1 23 32 0=12
Reshape                  reshape_41               1 1 22 33 0=12
Reshape                  reshape_42               1 1 21 34 0=12
Split                    splitncnn_3              1 3 34 35 36 37
Concat                   cat_0                    3 1 35 28 27 38 0=0
Flatten                  flatten_56               1 1 38 39
Concat                   cat_1                    2 1 39 17 40 0=0
Split                    splitncnn_4              1 2 40 41 42
Slice                    unbind_2                 1 12 in2 43 44 45 46 47 48 49 50 51 52 53 54 -23300=12,-233,-233,-233,-233,-233,-233,-233,-233,-233,-233,-233,-233 1=0
Reshape                  reshape_43               1 1 54 55 0=200 1=2
Reshape                  reshape_44               1 1 53 56 0=200 1=2
Reshape                  reshape_45               1 1 52 57 0=200 1=2
Reshape                  reshape_46               1 1 51 58 0=200 1=2
Reshape                  reshape_47               1 1 50 59 0=200 1=2
Reshape                  reshape_48               1 1 49 60 0=200 1=2
Reshape                  reshape_49               1 1 48 61 0=200 1=2
Reshape                  reshape_50               1 1 47 62 0=200 1=2
Reshape                  reshape_51               1 1 46 63 0=200 1=2
Reshape                  reshape_52               1 1 45 64 0=200 1=2
Reshape                  reshape_53               1 1 44 65 0=200 1=2
Reshape                  reshape_54               1 1 43 66 0=200 1=2
Crop                     slice_0                  1 1 42 67 -23310=1,-6 -23311=1,0 -23309=1,0
InnerProduct             fcrelu_1                 1 1 67 68 0=200 1=1 2=7200 9=1
ExpandDims               unsqueeze_67             1 1 68 69 -23303=1,0
Slice                    chunk_0                  1 2 66 70 71 -23300=2,-233,-233 1=0
Slice                    chunk_1                  1 2 65 72 73 -23300=2,-233,-233 1=0
LSTM                     lstm_22                  3 3 69 70 72 74 75 76 0=200 1=160000 2=0 3=200
LSTM                     lstm_23                  3 3 74 71 73 77 78 79 0=200 1=160000 2=0 3=200
Concat                   cat_2                    2 1 75 78 80 0=0
Concat                   cat_3                    2 1 76 79 81 0=0
Gemm                     gemm_1                   1 1 77 82 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=6 9=200
Squeeze                  squeeze_60               1 1 82 83 -23303=1,-2
Split                    splitncnn_5              1 2 83 84 85
Concat                   cat_4                    2 1 41 84 86 0=0
InnerProduct             fcrelu_2                 1 1 86 87 0=200 1=1 2=9600 9=1
ExpandDims               unsqueeze_68             1 1 87 88 -23303=1,0
Slice                    chunk_2                  1 2 64 89 90 -23300=2,-233,-233 1=0
Slice                    chunk_3                  1 2 63 91 92 -23300=2,-233,-233 1=0
LSTM                     lstm_24                  3 3 88 89 91 93 94 95 0=200 1=160000 2=0 3=200
LSTM                     lstm_25                  3 3 93 90 92 96 97 98 0=200 1=160000 2=0 3=200
Concat                   cat_5                    2 1 94 97 99 0=0
Concat                   cat_6                    2 1 95 98 100 0=0
Gemm                     gemm_2                   1 1 96 101 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=24 9=200
Squeeze                  squeeze_61               1 1 101 102 -23303=1,-2
ExpandDims               unsqueeze_69             1 1 80 103 -23303=1,0
ExpandDims               unsqueeze_70             1 1 81 104 -23303=1,0
ExpandDims               unsqueeze_71             1 1 99 105 -23303=1,0
ExpandDims               unsqueeze_72             1 1 100 106 -23303=1,0
Concat                   cat_7                    4 1 36 33 32 30 107 0=0
Flatten                  flatten_57               1 1 107 108
Concat                   cat_8                    2 1 108 18 109 0=0
Split                    splitncnn_6              1 2 109 110 111
Crop                     slice_1                  1 1 111 112 -23310=1,-6 -23311=1,0 -23309=1,0
InnerProduct             fcrelu_3                 1 1 112 113 0=200 1=1 2=9600 9=1
ExpandDims               unsqueeze_73             1 1 113 114 -23303=1,0
Slice                    chunk_4                  1 2 62 115 116 -23300=2,-233,-233 1=0
Slice                    chunk_5                  1 2 61 117 118 -23300=2,-233,-233 1=0
LSTM                     lstm_26                  3 3 114 115 117 119 120 121 0=200 1=160000 2=0 3=200
LSTM                     lstm_27                  3 3 119 116 118 122 123 124 0=200 1=160000 2=0 3=200
Concat                   cat_9                    2 1 120 123 125 0=0
Concat                   cat_10                   2 1 121 124 126 0=0
Gemm                     gemm_3                   1 1 122 127 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=12 9=200
Squeeze                  squeeze_62               1 1 127 128 -23303=1,-2
Split                    splitncnn_7              1 2 128 129 130
Concat                   cat_11                   2 1 110 129 131 0=0
InnerProduct             fcrelu_4                 1 1 131 132 0=200 1=1 2=13200 9=1
ExpandDims               unsqueeze_74             1 1 132 133 -23303=1,0
Slice                    chunk_6                  1 2 60 134 135 -23300=2,-233,-233 1=0
Slice                    chunk_7                  1 2 59 136 137 -23300=2,-233,-233 1=0
LSTM                     lstm_28                  3 3 133 134 136 138 139 140 0=200 1=160000 2=0 3=200
LSTM                     lstm_29                  3 3 138 135 137 141 142 143 0=200 1=160000 2=0 3=200
Concat                   cat_12                   2 1 139 142 144 0=0
Concat                   cat_13                   2 1 140 143 145 0=0
Gemm                     gemm_4                   1 1 141 146 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=12 9=200
Squeeze                  squeeze_63               1 1 146 147 -23303=1,-2
ExpandDims               unsqueeze_75             1 1 125 148 -23303=1,0
ExpandDims               unsqueeze_76             1 1 126 149 -23303=1,0
ExpandDims               unsqueeze_77             1 1 144 150 -23303=1,0
ExpandDims               unsqueeze_78             1 1 145 151 -23303=1,0
Concat                   cat_14                   2 1 37 31 152 0=0
Flatten                  flatten_58               1 1 152 153
Concat                   cat_15                   2 1 153 19 154 0=0
Split                    splitncnn_8              1 2 154 155 156
Crop                     slice_2                  1 1 156 157 -23310=1,-6 -23311=1,0 -23309=1,0
InnerProduct             fcrelu_5                 1 1 157 158 0=200 1=1 2=4800 9=1
ExpandDims               unsqueeze_79             1 1 158 159 -23303=1,0
Slice                    chunk_8                  1 2 58 160 161 -23300=2,-233,-233 1=0
Slice                    chunk_9                  1 2 57 162 163 -23300=2,-233,-233 1=0
LSTM                     lstm_30                  3 3 159 160 162 164 165 166 0=200 1=160000 2=0 3=200
LSTM                     lstm_31                  3 3 164 161 163 167 168 169 0=200 1=160000 2=0 3=200
Concat                   cat_16                   2 1 165 168 170 0=0
Concat                   cat_17                   2 1 166 169 171 0=0
Gemm                     gemm_5                   1 1 167 172 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=6 9=200
Squeeze                  squeeze_64               1 1 172 173 -23303=1,-2
Split                    splitncnn_9              1 2 173 174 175
Concat                   cat_18                   2 1 155 174 176 0=0
InnerProduct             fcrelu_6                 1 1 176 177 0=200 1=1 2=7200 9=1
ExpandDims               unsqueeze_80             1 1 177 178 -23303=1,0
Slice                    chunk_10                 1 2 56 179 180 -23300=2,-233,-233 1=0
Slice                    chunk_11                 1 2 55 181 182 -23300=2,-233,-233 1=0
LSTM                     lstm_32                  3 3 178 179 181 183 184 185 0=200 1=160000 2=0 3=200
LSTM                     lstm_33                  3 3 183 180 182 186 187 188 0=200 1=160000 2=0 3=200
Concat                   cat_19                   2 1 184 187 189 0=0
Concat                   cat_20                   2 1 185 188 190 0=0
Gemm                     gemm_6                   1 1 186 191 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=30 9=200
Squeeze                  squeeze_65               1 1 191 192 -23303=1,-2
ExpandDims               unsqueeze_81             1 1 170 193 -23303=1,0
ExpandDims               unsqueeze_82             1 1 171 194 -23303=1,0
ExpandDims               unsqueeze_83             1 1 189 195 -23303=1,0
ExpandDims               unsqueeze_84             1 1 190 196 -23303=1,0
Concat                   cat_21                   12 1 103 104 105 106 148 149 150 151 193 194 195 196 out3 0=0
Concat                   cat_22                   3 1 85 130 175 out0 0=0
Concat                   cat_23                   3 1 102 147 192 out1 0=1
